#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>

typedef unsigned char UCHAR;
typedef unsigned char u8;
typedef unsigned long ULONG;
typedef signed char SCHAR;
typedef unsigned int u32;

//*********************************************************************************************************************************
// o SEED_Sbox1[]		: SEED_G() 함수에서 사용하는 사용되는 대치 테이블로서 8비트를 입력받아 8비트를 출력함
//*********************************************************************************************************************************
UCHAR SEED_S1box[256] = {
	0xa9, 0x85, 0xd6, 0xd3, 0x54, 0x1d, 0xac, 0x25, 0x5d, 0x43, 0x18, 0x1e, 0x51, 0xfc, 0xca, 0x63,
	0x28, 0x44, 0x20, 0x9d, 0xe0, 0xe2, 0xc8, 0x17, 0xa5, 0x8f, 0x03, 0x7b, 0xbb, 0x13, 0xd2, 0xee,
	0x70, 0x8c, 0x3f, 0xa8, 0x32, 0xdd, 0xf6, 0x74, 0xec, 0x95, 0x0b, 0x57, 0x5c, 0x5b, 0xbd, 0x01,
	0x24, 0x1c, 0x73, 0x98, 0x10, 0xcc, 0xf2, 0xd9, 0x2c, 0xe7, 0x72, 0x83, 0x9b, 0xd1, 0x86, 0xc9,
	0x60, 0x50, 0xa3, 0xeb, 0x0d, 0xb6, 0x9e, 0x4f, 0xb7, 0x5a, 0xc6, 0x78, 0xa6, 0x12, 0xaf, 0xd5,
	0x61, 0xc3, 0xb4, 0x41, 0x52, 0x7d, 0x8d, 0x08, 0x1f, 0x99, 0x00, 0x19, 0x04, 0x53, 0xf7, 0xe1,
	0xfd, 0x76, 0x2f, 0x27, 0xb0, 0x8b, 0x0e, 0xab, 0xa2, 0x6e, 0x93, 0x4d, 0x69, 0x7c, 0x09, 0x0a,
	0xbf, 0xef, 0xf3, 0xc5, 0x87, 0x14, 0xfe, 0x64, 0xde, 0x2e, 0x4b, 0x1a, 0x06, 0x21, 0x6b, 0x66,
	0x02, 0xf5, 0x92, 0x8a, 0x0c, 0xb3, 0x7e, 0xd0, 0x7a, 0x47, 0x96, 0xe5, 0x26, 0x80, 0xad, 0xdf,
	0xa1, 0x30, 0x37, 0xae, 0x36, 0x15, 0x22, 0x38, 0xf4, 0xa7, 0x45, 0x4c, 0x81, 0xe9, 0x84, 0x97,
	0x35, 0xcb, 0xce, 0x3c, 0x71, 0x11, 0xc7, 0x89, 0x75, 0xfb, 0xda, 0xf8, 0x94, 0x59, 0x82, 0xc4,
	0xff, 0x49, 0x39, 0x67, 0xc0, 0xcf, 0xd7, 0xb8, 0x0f, 0x8e, 0x42, 0x23, 0x91, 0x6c, 0xdb, 0xa4,
	0x34, 0xf1, 0x48, 0xc2, 0x6f, 0x3d, 0x2d, 0x40, 0xbe, 0x3e, 0xbc, 0xc1, 0xaa, 0xba, 0x4e, 0x55,
	0x3b, 0xdc, 0x68, 0x7f, 0x9c, 0xd8, 0x4a, 0x56, 0x77, 0xa0, 0xed, 0x46, 0xb5, 0x2b, 0x65, 0xfa,
	0xe3, 0xb9, 0xb1, 0x9f, 0x5e, 0xf9, 0xe6, 0xb2, 0x31, 0xea, 0x6d, 0x5f, 0xe4, 0xf0, 0xcd, 0x88,
	0x16, 0x3a, 0x58, 0xd4, 0x62, 0x29, 0x07, 0x33, 0xe8, 0x1b, 0x05, 0x79, 0x90, 0x6a, 0x2a, 0x9a };


//*********************************************************************************************************************************
// o SEED_Sbox2[]		: SEED_G() 함수에서 사용하는 사용되는 대치 테이블로서 8비트를 입력받아 8비트를 출력함
//*********************************************************************************************************************************
UCHAR SEED_S2box[256] = {
	0x38, 0xe8, 0x2d, 0xa6, 0xcf, 0xde, 0xb3, 0xb8, 0xaf, 0x60, 0x55, 0xc7, 0x44, 0x6f, 0x6b, 0x5b,
	0xc3, 0x62, 0x33, 0xb5, 0x29, 0xa0, 0xe2, 0xa7, 0xd3, 0x91, 0x11, 0x06, 0x1c, 0xbc, 0x36, 0x4b,
	0xef, 0x88, 0x6c, 0xa8, 0x17, 0xc4, 0x16, 0xf4, 0xc2, 0x45, 0xe1, 0xd6, 0x3f, 0x3d, 0x8e, 0x98,
	0x28, 0x4e, 0xf6, 0x3e, 0xa5, 0xf9, 0x0d, 0xdf, 0xd8, 0x2b, 0x66, 0x7a, 0x27, 0x2f, 0xf1, 0x72,
	0x42, 0xd4, 0x41, 0xc0, 0x73, 0x67, 0xac, 0x8b, 0xf7, 0xad, 0x80, 0x1f, 0xca, 0x2c, 0xaa, 0x34,
	0xd2, 0x0b, 0xee, 0xe9, 0x5d, 0x94, 0x18, 0xf8, 0x57, 0xae, 0x08, 0xc5, 0x13, 0xcd, 0x86, 0xb9,
	0xff, 0x7d, 0xc1, 0x31, 0xf5, 0x8a, 0x6a, 0xb1, 0xd1, 0x20, 0xd7, 0x02, 0x22, 0x04, 0x68, 0x71,
	0x07, 0xdb, 0x9d, 0x99, 0x61, 0xbe, 0xe6, 0x59, 0xdd, 0x51, 0x90, 0xdc, 0x9a, 0xa3, 0xab, 0xd0,
	0x81, 0x0f, 0x47, 0x1a, 0xe3, 0xec, 0x8d, 0xbf, 0x96, 0x7b, 0x5c, 0xa2, 0xa1, 0x63, 0x23, 0x4d,
	0xc8, 0x9e, 0x9c, 0x3a, 0x0c, 0x2e, 0xba, 0x6e, 0x9f, 0x5a, 0xf2, 0x92, 0xf3, 0x49, 0x78, 0xcc,
	0x15, 0xfb, 0x70, 0x75, 0x7f, 0x35, 0x10, 0x03, 0x64, 0x6d, 0xc6, 0x74, 0xd5, 0xb4, 0xea, 0x09,
	0x76, 0x19, 0xfe, 0x40, 0x12, 0xe0, 0xbd, 0x05, 0xfa, 0x01, 0xf0, 0x2a, 0x5e, 0xa9, 0x56, 0x43,
	0x85, 0x14, 0x89, 0x9b, 0xb0, 0xe5, 0x48, 0x79, 0x97, 0xfc, 0x1e, 0x82, 0x21, 0x8c, 0x1b, 0x5f,
	0x77, 0x54, 0xb2, 0x1d, 0x25, 0x4f, 0x00, 0x46, 0xed, 0x58, 0x52, 0xeb, 0x7e, 0xda, 0xc9, 0xfd,
	0x30, 0x95, 0x65, 0x3c, 0xb6, 0xe4, 0xbb, 0x7c, 0x0e, 0x50, 0x39, 0x26, 0x32, 0x84, 0x69, 0x93,
	0x37, 0xe7, 0x24, 0xa4, 0xcb, 0x53, 0x0a, 0x87, 0xd9, 0x4c, 0x83, 0x8f, 0xce, 0x3b, 0x4a, 0xb7 };

//*********************************************************************************************************************************
// o SEED_KC[]				: SEED 키스케쥴 함수에서 사용되는 라운드 상수		
//                            KC[0] = golden ratio; KC[i] = ROTL(KC[i-1], 1)   
//*********************************************************************************************************************************
const ULONG SEED_KC[24] =
{
	0x9e3779b9UL, 0x3c6ef373UL, 0x78dde6e6UL, 0xf1bbcdccUL,
	0xe3779b99UL, 0xc6ef3733UL, 0x8dde6e67UL, 0x1bbcdccfUL,
	0x3779b99eUL, 0x6ef3733cUL, 0xdde6e678UL, 0xbbcdccf1UL,
	0x779b99e3UL, 0xef3733c6UL, 0xde6e678dUL, 0xbcdccf1bUL,
	0x79b99e37UL, 0xf3733c6eUL, 0xe6e678ddUL, 0xcdccf1bbUL,
	0x9b99e377UL, 0x3733c6efUL, 0x6e678ddeUL, 0xdccf1bbcUL
};

//*********************************************************************************************************************************
// o u4byte_in()	: 8비트 상수 4개를 32비트 상수 묶음으로 변환
//*********************************************************************************************************************************
u32 u4byte_in(const UCHAR* x) {
	return (x[0] << 24) | (x[1] << 16) | (x[2] << 8) | x[3];
}

//*********************************************************************************************************************************
// o u4byte_out()	: 32비트 상수를 8비트 상수 4개로 나누는데 사용하는 함수
//*********************************************************************************************************************************
void u4byte_out(UCHAR* x, const u32 y) {
	x[0] = (y >> 24) & 0xff;
	x[1] = (y >> 16) & 0xff;
	x[2] = (y >> 8) & 0xff;
	x[3] = y & 0xff;
}

//*********************************************************************************************************************************
// o SEED_G[]	: SEED_Round() 함수와 SEED_KeySchedule() 함수에 사용되는 함수
// o 입력		: S	- 4-바이트 입력 변수
// o 출력		: S	- 4-바이트 입력 변수를 갱신한 뒤 출력하는 변수
//*********************************************************************************************************************************
void SEED_G(ULONG* S)
{
	UCHAR  Y[4];

	Y[0] = SEED_S1box[((*S) >> 0) & 0xFF];
	Y[1] = SEED_S2box[((*S) >> 8) & 0xFF];
	Y[2] = SEED_S1box[((*S) >> 16) & 0xFF];
	Y[3] = SEED_S2box[((*S) >> 24) & 0xFF];

	(*S) = ((ULONG)((Y[0] & 0xFC) ^ (Y[1] & 0xF3) ^ (Y[2] & 0xCF) ^ (Y[3] & 0x3F)) << 0) |
		((ULONG)((Y[0] & 0xF3) ^ (Y[1] & 0xCF) ^ (Y[2] & 0x3F) ^ (Y[3] & 0xFC)) << 8) |
		((ULONG)((Y[0] & 0xCF) ^ (Y[1] & 0x3F) ^ (Y[2] & 0xFC) ^ (Y[3] & 0xF3)) << 16) |
		((ULONG)((Y[0] & 0x3F) ^ (Y[1] & 0xFC) ^ (Y[2] & 0xF3) ^ (Y[3] & 0xCF)) << 24);
}

//*********************************************************************************************************************************
// o SEED_Round[]	: SEED에 사용되는 라운드 함수 
// o 입력			: R[]	- 8-바이트 내부 상태를 입력받는 변수
//					: K[]   - 8-바이트 라운드 키를 입력받는 변수
// o 출력			: L[]	- 8-바이트 내부 상태를 갱신한 뒤 출력하는 변수
//*********************************************************************************************************************************
void SEED_RoundF(ULONG L[2], ULONG R[2], ULONG K[2])
{
	ULONG temp[2];

	temp[0] = R[0] ^ K[0];
	temp[1] = R[1] ^ K[1];

	temp[1] ^= temp[0];

	SEED_G(temp + 1);
	temp[0] += temp[1];

	SEED_G(temp);
	temp[1] += temp[0];

	SEED_G(temp + 1);
	temp[0] += temp[1];

	L[0] ^= temp[0];
	L[1] ^= temp[1];
}

//*********************************************************************************************************************************
// o SEED_IStateTransformation()	: SEED 암호 알고리즘의 평문을 내부상태로 변환하는 함수	
// o 입력		: PT	- SEED 암호 알고리즘에 입력된 평문
// o 출력		: L[]	- SEED 암호 알고리즘의 왼쪽 내부 상태값
//      		: R[]	- SEED 암호 알고리즘의 오른쪽 내부 상태값
//*********************************************************************************************************************************
void SEED_IStateTransformation(const UCHAR PT[16], ULONG L[2], ULONG R[2])
{
	L[0] = u4byte_in(PT);		L[1] = u4byte_in(PT + 4);
	R[0] = u4byte_in(PT + 8);		R[1] = u4byte_in(PT + 12);
}

//*********************************************************************************************************************************
// o SEED_OStateTransformation()	: SEED 암호 알고리즘의 평문을 내부상태로 변환하는 함수	
// o 입력		: L[]	- SEED 암호 알고리즘의 왼쪽 내부 상태값
//      		: R[]	- SEED 암호 알고리즘의 오른쪽 내부 상태값
// o 출력		: CT	- SEED 암호 알고리즘에 출력할 평문
//*********************************************************************************************************************************
void SEED_OStateTransformation(UCHAR CT[16], const ULONG L[2], const ULONG R[2])
{
	u4byte_out(CT, L[0]);		u4byte_out(CT + 4, L[1]);
	u4byte_out(CT + 8, R[0]);		u4byte_out(CT + 12, R[1]);
}


//*********************************************************************************************************************************
// o SEED_ENC()	: SEED 암호화 함수로서 128 비트 (16 바이트)평문과 라운드 키를 입력받아 암호문을 출력하는 함수		
// o 입력		: PT[]	- 암호화되어야 할 128-비트(16-바이트) 평문을 입력받는 변수
//				: RK[]	- 라운드 키를 입력받는 변수 
// o 출력		: CT[]	- 입력된 평문을 암호화한 암호문을 출력하는 변수
//*********************************************************************************************************************************
void SEED_ENC(const UCHAR PT[16], UCHAR CT[16], ULONG RK[][2], ULONG keysize)
{
	ULONG L[2], R[2];	// SEED 암호화 함수에서의 내부 상태 변수
	SCHAR Round;		// 라운드 함수 반복을 위한 현재 상태의 라운드를 가리키는 변수		
	UCHAR Nr;

	Nr = (UCHAR)(8 + keysize / 16);

	// 평문을 내부상태로 변환함
	SEED_IStateTransformation(PT, L, R);

	// 1-16 라운드 함수
	for (Round = 0; Round < Nr; Round += 2)
	{
		SEED_RoundF(L, R, RK[Round]);
		SEED_RoundF(R, L, RK[Round + 1]);
	}

	// 내부상태를 암호문으로 입력함
	SEED_OStateTransformation(CT, R, L);
}


//*********************************************************************************************************************************
// o SEED_ENC_PRINT()	: SEED 암호화 함수로서 128 비트 (16 바이트)평문과 라운드 키를 입력받아 중간 내부상태값을 출력하고 암호문을 출력하는 함수		
// o 입력		: PT[]	- 암호화되어야 할 128-비트(16-바이트) 평문을 입력받는 변수
//				: RK[]	- 라운드 키를 입력받는 변수 
// o 출력		: CT[]	- 입력된 평문을 암호화한 암호문을 출력하는 변수
//*********************************************************************************************************************************
void SEED_ENC_PRINT(const UCHAR PT[16], UCHAR CT[16], ULONG RK[][2], ULONG keysize)
{
	FILE* fo;

	ULONG L[2], R[2];	// SEED 암호화 함수에서의 내부 상태 변수
	SCHAR Round, i;		// 라운드 함수 반복을 위한 현재 상태의 라운드를 가리키는 변수		
	UCHAR Nr;

	fo = fopen("SEED_ENC_TEST.txt", "w");

	Nr = (UCHAR)(8 + keysize / 16);

	for (i = 0; i < 16; i++)
		fprintf(fo, "%02x\t ", PT[i]);
	fprintf(fo, "\n");

	// 평문을 내부상태로 변환함
	SEED_IStateTransformation(PT, L, R);
	for (i = 0; i < 2; i++)
		fprintf(fo, "%08x\t ", L[i]);
	for (i = 0; i < 2; i++)
		fprintf(fo, "%08x\t ", R[i]);
	fprintf(fo, "\n");

	// 1-16 라운드 함수
	for (Round = 0; Round < Nr; Round += 2)
	{
		SEED_RoundF(L, R, RK[Round]);
		for (i = 0; i < 2; i++)
			fprintf(fo, "%08x\t ", R[i]);
		for (i = 0; i < 2; i++)
			fprintf(fo, "%08x\t ", L[i]);
		fprintf(fo, "\n");

		SEED_RoundF(R, L, RK[Round + 1]);
		for (i = 0; i < 2; i++)
			fprintf(fo, "%08x\t ", L[i]);
		for (i = 0; i < 2; i++)
			fprintf(fo, "%08x\t ", R[i]);
		fprintf(fo, "\n");
	}

	// 내부상태를 암호문으로 입력함
	SEED_OStateTransformation(CT, R, L);
	for (i = 0; i < 16; i++)
		fprintf(fo, "%02x\t ", CT[i]);
	fprintf(fo, "\n");

	fclose(fo);

}

//*********************************************************************************************************************************
// o SEED_DEC()	: SEED 복호화 함수로서 128-비트(16-바이트) 암호문과 라운드 키를 입력받아 평문을 출력하는 암호화 함수
// o 입력		: CT[]	- 복호화되어야 할 128-비트(16-바이트) 암호문을 입력받는 변수
//				: RK[]	- 라운드 키를 입력받는 변수 
// o 출력		: PT[]	- 입력된 암호문을 복호화한 평문을 출력하는 변수
//*********************************************************************************************************************************
void SEED_DEC(const UCHAR CT[16], UCHAR PT[16], ULONG RK[][2], ULONG keysize)
{
	ULONG L[2], R[2];	// SEED 암호화 함수에서의 내부 상태 변수
	SCHAR Round;		// 라운드 함수 반복을 위한 현재 상태의 라운드를 가르키는 변수		
	UCHAR Nr;

	Nr = (UCHAR)(8 + keysize / 16);

	// 평문을 내부상태로 변환함
	SEED_IStateTransformation(CT, L, R);

	// 1-16 라운드 함수
	for (Round = Nr - 1; Round >= 0; Round -= 2)
	{
		SEED_RoundF(L, R, RK[Round]);
		SEED_RoundF(R, L, RK[Round - 1]);
	}

	// 내부상태를 암호문으로 입력함
	SEED_OStateTransformation(PT, R, L);
}

//*********************************************************************************************************************************
// o SEED_DEC_PRINT()	: SEED 복호화 함수로서 128-비트(16-바이트) 암호문과 라운드 키를 입력받아 중간 내부상태값을 출력하고 평문을 출력하는 암호화 함수
// o 입력		: CT[]	- 복호화되어야 할 128-비트(16-바이트) 암호문을 입력받는 변수
//				: RK[]	- 라운드 키를 입력받는 변수 
// o 출력		: PT[]	- 입력된 암호문을 복호화한 평문을 출력하는 변수
//*********************************************************************************************************************************
void SEED_DEC_PRINT(const UCHAR CT[16], UCHAR PT[16], ULONG RK[][2], ULONG keysize)
{
	FILE* fo;
	ULONG L[2], R[2];	// SEED 암호화 함수에서의 내부 상태 변수
	SCHAR Round, i;		// 라운드 함수 반복을 위한 현재 상태의 라운드를 가르키는 변수		
	UCHAR Nr;

	fo = fopen("SEED_DEC_TEST.txt", "w");

	Nr = (UCHAR)(8 + keysize / 16);

	for (i = 0; i < 16; i++)
		fprintf(fo, "%02x\t ", CT[i]);
	fprintf(fo, "\n");

	// 평문을 내부상태로 변환함
	SEED_IStateTransformation(CT, L, R);
	for (i = 0; i < 2; i++)
		fprintf(fo, "%08x\t ", L[i]);
	for (i = 0; i < 2; i++)
		fprintf(fo, "%08x\t ", R[i]);
	fprintf(fo, "\n");

	// 1-16 라운드 함수
	for (Round = Nr - 1; Round >= 0; Round -= 2)
	{
		SEED_RoundF(L, R, RK[Round]);
		for (i = 0; i < 2; i++)
			fprintf(fo, "%08x\t ", R[i]);
		for (i = 0; i < 2; i++)
			fprintf(fo, "%08x\t ", L[i]);
		fprintf(fo, "\n");

		SEED_RoundF(R, L, RK[Round - 1]);
		for (i = 0; i < 2; i++)
			fprintf(fo, "%08x\t ", L[i]);
		for (i = 0; i < 2; i++)
			fprintf(fo, "%08x\t ", R[i]);
		fprintf(fo, "\n");
	}

	// 내부상태를 암호문으로 입력함
	SEED_OStateTransformation(PT, R, L);
	for (i = 0; i < 16; i++)
		fprintf(fo, "%02x\t ", PT[i]);
	fprintf(fo, "\n");
	fclose(fo);

}

//*********************************************************************************************************************************
// o SEED_128RoundKey_Generation()	: SEED-128 키스케쥴 함수에서 특정 라운드 키를 생성하는 함수		
// o 입력							: A, B, C, D - 특정 라운드 키를 생성하기 위한 키 스케줄의 내부 상태값
//  								: R	- 해당 라운드 수
// o 출력							: RK	- 특정 라운드 키를 출력하는 변수
//*********************************************************************************************************************************
void SEED_128RoundKey_Generation(ULONG A, ULONG B, ULONG C, ULONG D, ULONG R, ULONG RK[][2])
{
	ULONG T0, T1;

	T0 = A + C - SEED_KC[R];
	T1 = B - D + SEED_KC[R];
	RK[R][0] = T0;
	RK[R][1] = T1;
	SEED_G(RK[R]);
	SEED_G(RK[R] + 1);
}

//*********************************************************************************************************************************
// o SEED_192RoundKey_Generation()	: SEED-192 키스케쥴 함수에서 특정 라운드 키를 생성하는 함수		
// o 입력							: A, B, C, D, E, F - 특정 라운드 키를 생성하기 위한 키 스케줄의 내부 상태값
//  								: R	- 해당 라운드 수
// o 출력							: RK	- 특정 라운드 키를 출력하는 변수
//*********************************************************************************************************************************
void SEED_192RoundKey_Generation(ULONG A, ULONG B, ULONG C, ULONG D, ULONG E, ULONG F, ULONG R, ULONG RK[][2])
{
	ULONG T0, T1;

	T0 = ((A + C) ^ D) - SEED_KC[R];
	T1 = ((B - E) ^ F) + SEED_KC[R];
	RK[R][0] = T0;
	RK[R][1] = T1;
	SEED_G(RK[R]);
	SEED_G(RK[R] + 1);
}

//*********************************************************************************************************************************
// o SEED_256RoundKey_Generation()	: SEED-256 키스케쥴 함수에서 특정 라운드 키를 생성하는 함수		
// o 입력							: A, B, C, D, E, F, G, H - 특정 라운드 키를 생성하기 위한 키 스케줄의 내부 상태값
//  								: R	- 해당 라운드 수
// o 출력							: RK	- 특정 라운드 키를 출력하는 변수
//*********************************************************************************************************************************
void SEED_256RoundKey_Generation(ULONG A, ULONG B, ULONG C, ULONG D, ULONG E, ULONG F, ULONG G, ULONG H, ULONG R, ULONG RK[][2])
{
	ULONG T0, T1;

	T0 = (((A + C) ^ E) - F) ^ SEED_KC[R];
	T1 = (((B - D) ^ G) + H) ^ SEED_KC[R];
	RK[R][0] = T0;
	RK[R][1] = T1;
	SEED_G(RK[R]);
	SEED_G(RK[R] + 1);
}

//*********************************************************************************************************************************
// o TwoWordRRot()				: SEED 키스케쥴 함수에서 사용되는 오른쪽 64비트 로테이션 함수		
// o 입력						: A||B	- 순환이동함수에 입력된 32비트 워드 2개
// o 출력						: A||B	- 수환이동함수에 의하여 갱신된 32 비트 워드 2개
//*********************************************************************************************************************************
#define TwoWordRRot(A,B) 				\
		T = A;							\
		A = (A>>8) ^ (B<<24);			\
		B = (B>>8) ^ (T<<24);			\

//*********************************************************************************************************************************
// o TwoWordLRot()				: SEED 키스케쥴 함수에서 사용되는 왼쪽 64비트 로테이션 함수		
// o 입력						: A||B	- 순환이동함수에 입력된 32비트 워드 2개
// o 출력						: A||B	- 수환이동함수에 의하여 갱신된 32 비트 워드 2개
//*********************************************************************************************************************************
#define TwoWordLRot(A,B) 				\
		T = A;							\
		A = (A<<8) ^ (B>>24);			\
		B = (B<<8) ^ (T>>24);			\
//*********************************************************************************************************************************
// o ThreeWordRRot()				: SEED 키스케쥴 함수에서 사용되는 오른쪽 96비트 로테이션 함수		
// o 입력						: A||B||C	- 순환이동함수에 입력된 32비트 워드 3개
// o 출력						: A||B||C	- 수환이동함수에 의하여 갱신된 32 비트 워드 3개
//*********************************************************************************************************************************
#define ThreeWordRRot(A,B,C,Rot) 		\
		T = A;							\
		A = (A>>Rot) ^ (B<<(32-Rot));	\
		B = (B>>Rot) ^ (C<<(32-Rot));	\
		C = (C>>Rot) ^ (T<<(32-Rot));	\

//*********************************************************************************************************************************
// o ThreeWordLRot()				: SEED 키스케쥴 함수에서 사용되는 왼쪽 96비트 로테이션 함수		
// o 입력						: A||B||C	- 순환이동함수에 입력된 32비트 워드 3개
// o 출력						: A||B||C	- 수환이동함수에 의하여 갱신된 32 비트 워드 3개
//*********************************************************************************************************************************
#define ThreeWordLRot(A,B,C,Rot) 		\
		T = A;							\
		A = (A<<Rot) ^ (B>>(32-Rot));	\
		B = (B<<Rot) ^ (C>>(32-Rot));	\
		C = (C<<Rot) ^ (T>>(32-Rot));	\

//*********************************************************************************************************************************
// o FourWordRRot()				: SEED 키스케쥴 함수에서 사용되는 오른쪽 128비트 로테이션 함수		
// o 입력						: A||B||C||D	- 순환이동함수에 입력된 32비트 워드 4개
// o 출력						: A||B||C||D	- 수환이동함수에 의하여 갱신된 32 비트 워드 4개
//*********************************************************************************************************************************
#define FourWordRRot(A,B,C,D,Rot)		\
		T = A;							\
		A = (A>>Rot) ^ (B<<(32-Rot));	\
		B = (B>>Rot) ^ (C<<(32-Rot));	\
		C = (C>>Rot) ^ (D<<(32-Rot));	\
		D = (D>>Rot) ^ (T<<(32-Rot));	\

//*********************************************************************************************************************************
// o FourWordLRot()				: SEED 키스케쥴 함수에서 사용되는 왼쪽 128비트 로테이션 함수		
// o 입력						: A||B||C||D	- 순환이동함수에 입력된 32비트 워드 4개
// o 출력						: A||B||C||D	- 수환이동함수에 의하여 갱신된 32 비트 워드 4개
//*********************************************************************************************************************************
#define FourWordLRot(A,B,C,D,Rot)		\
		T = A;							\
		A = (A<<Rot) ^ (B>>(32-Rot));	\
		B = (B<<Rot) ^ (C>>(32-Rot));	\
		C = (C<<Rot) ^ (D>>(32-Rot));	\
		D = (D<<Rot) ^ (T>>(32-Rot));	\

//*********************************************************************************************************************************
// o SEED_128KeyGeneration()	: SEED 키스케쥴 함수로서 128 비트 마스터키를 입력 받아 128 비트 라운드 키를 생성하는 함수		
// o 입력						: MK[]		- SEED 알고리즘의 마스터 키를 입력받는 변수 
// o 출력						: RK[][]	- SEED 키 스케줄에 의하여 생성된 라운드 키를 출력하는 함수
//*********************************************************************************************************************************

void SEED_128KeyGeneration(const UCHAR MK[], ULONG RK[][2])
{
	ULONG A, B, C, D;
	ULONG T;
	ULONG i;

	A = u4byte_in(MK);	B = u4byte_in(MK + 4);
	C = u4byte_in(MK + 8);	D = u4byte_in(MK + 12);

	for (i = 0; i < 16; i += 2)
	{
		SEED_128RoundKey_Generation(A, B, C, D, i, RK);
		TwoWordRRot(A, B);
		SEED_128RoundKey_Generation(A, B, C, D, (i + 1), RK);
		TwoWordLRot(C, D);
	}
}

//*********************************************************************************************************************************
// o SEED_192KeyGeneration()	: SEED 키스케쥴 함수로서 128 비트 마스터키를 입력 받아 192 비트 라운드 키를 생성하는 함수		
// o 입력						: MK[]		- SEED 알고리즘의 마스터 키를 입력받는 변수 
// o 출력						: RK[][]	- SEED 키 스케줄에 의하여 생성된 라운드 키를 출력하는 함수
//*********************************************************************************************************************************

void SEED_192KeyGeneration(const UCHAR MK[], ULONG RK[][2])
{
	ULONG A, B, C, D, E, F;
	ULONG T;
	ULONG Rot;
	ULONG R;

	A = u4byte_in(MK);	B = u4byte_in(MK + 4);
	C = u4byte_in(MK + 8);	D = u4byte_in(MK + 12);
	E = u4byte_in(MK + 16);	F = u4byte_in(MK + 20);

	for (R = 0; R < 20; R += 2)
	{
		switch ((R >> 1) % 3) {
		case 0: Rot = 9; break;
		case 1: Rot = 8; break;
		case 2: Rot = 12; break;
		}
		SEED_192RoundKey_Generation(A, B, C, D, E, F, R, RK);
		ThreeWordRRot(A, B, C, Rot);
		SEED_192RoundKey_Generation(A, B, C, D, E, F, (R + 1), RK);
		ThreeWordLRot(D, E, F, Rot);
	}
}

//*********************************************************************************************************************************
// o SEED_256KeyGeneration()	: SEED 키스케쥴 함수로서 128 비트 마스터키를 입력 받아 256 비트 라운드 키를 생성하는 함수		
// o 입력						: MK[]		- SEED 알고리즘의 마스터 키를 입력받는 변수 
// o 출력						: RK[][]	- SEED 키 스케줄에 의하여 생성된 라운드 키를 출력하는 함수
//*********************************************************************************************************************************

void SEED_256KeyGeneration(const UCHAR MK[], ULONG RK[][2])
{
	ULONG A, B, C, D, E, F, G, H;
	ULONG T;
	ULONG Rot;
	ULONG R;

	A = u4byte_in(MK);	B = u4byte_in(MK + 4);
	C = u4byte_in(MK + 8);	D = u4byte_in(MK + 12);
	E = u4byte_in(MK + 16);	F = u4byte_in(MK + 20);
	G = u4byte_in(MK + 24);	H = u4byte_in(MK + 28);


	for (R = 0; R < 24; R += 2)
	{
		switch ((R >> 1) % 3) {
		case 0: Rot = 9; break;
		case 1: Rot = 11; break;
		case 2: Rot = 12; break;
		}
		SEED_256RoundKey_Generation(A, B, C, D, E, F, G, H, R, RK);
		FourWordRRot(A, B, C, D, Rot);
		SEED_256RoundKey_Generation(A, B, C, D, E, F, G, H, (R + 1), RK);
		FourWordLRot(E, F, G, H, Rot);
	}
}

//*********************************************************************************************************************************
// o SEED_KeySchedule()	: SEED 키스케쥴 함수로서 128 비트 마스터키를 입력 받아 라운드 키를 생성하는 함수		
// o 입력				: MK[]		- SEED 알고리즘의 마스터 키를 입력받는 변수 
// o 출력				: RK[][]	- SEED 키 스케줄에 의하여 생성된 라운드 키를 출력하는 함수
//*********************************************************************************************************************************

void SEED_KeySchedule(const UCHAR MK[], ULONG RK[][2], const ULONG KeySize)
{
	if (KeySize == 128)		SEED_128KeyGeneration(MK, RK);
	else if (KeySize == 192) SEED_192KeyGeneration(MK, RK);
	else					SEED_256KeyGeneration(MK, RK);
}

int main() {

	const UCHAR MK[16] = { 0x00 };
	const UCHAR PT[16] = { 0x00, 0x01, 0x02, 0x03, 0x04, 0x05, 0x06, 0x07, 0x08, 0x09, 0x0a, 0x0b, 0x0c, 0x0d, 0x0e, 0x0f };
	ULONG RK[16][2] = { 0x00 };
	UCHAR CT[16] = { 0x00 };
	ULONG keysize = 128;

	SEED_KeySchedule(MK, RK, keysize);
	SEED_ENC(PT, CT, RK, keysize);

	for (int i = 0; i < 16; i++)
		printf("%02x ", CT[i]);
	printf("\n");

	/*
  SEED_KeySchedule(MK, RK, keysize);
	SEED_DEC(CT1, PT, RK, keysize);
	for (int i = 0; i < 16; i++)
		printf("%02x", PT[i]);
	printf("\n");
	SEED_DEC(CT2, PT, RK, keysize);
	for (int i = 0; i < 16; i++)
		printf("%02x", PT[i]);
	printf("\n");
  */

	return 0;
}
